#!/bin/bash

# Создаем папку build для объектных файлов
mkdir -p build

echo "==============================================="
echo "       СБОРКА ПРОЕКТА (GCC g++)"
echo "==============================================="

# -c      - только компиляция (создание .o), без линковки
# -o      - путь к выходному файлу
# -I.     - путь к заголовочным файлам (текущая папка)

echo "[1/3] Компиляция: main.cpp..."
g++ -c main.cpp -o build/main.o -I.
if [ $? -ne 0 ]; then exit 1; fi

echo "[2/3] Компиляция: f.cpp..."
g++ -c headers.cpp -o build/headers.o -I.
if [ $? -ne 0 ]; then exit 1; fi


echo "-----------------------------------------------"
echo "[3/3] Линковка: создание program..."
# Линкуем объектные файлы в один исполняемый файл
g++ build/main.o build/headers.o -o program
if [ $? -ne 0 ]; then exit 1; fi

echo "==============================================="
echo "  Сборка завершена! Запускаю программу..."
echo "==============================================="
echo ""

# Запуск программы
./program

echo ""
echo "-----------------------------------------------"
read -p "Нажмите Enter, чтобы выйти..."
